Using boolean indexing: You can filter the DataFrame based on a condition and extract the rows that meet that condition. For example, the following code filters the DataFrame to only include rows where the 'age' column is greater than 30:

In [3]:
import pandas as pd

# Create a sample DataFrame
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 32, 45, 38],
        'city': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)
df

      name  age         city
0    Alice   25     New York
1      Bob   32  Los Angeles
2  Charlie   45      Chicago
3    David   38      Houston

In [4]:
df[df['age'] > 30]

      name  age         city
1      Bob   32  Los Angeles
2  Charlie   45      Chicago
3    David   38      Houston

Using the query() method: You can use the query() method to filter the DataFrame based on a query expression. For example, the following code filters the DataFrame to only include rows where the 'name' column is 'Alice' or 'Bob':

In [5]:
df.query("name in ['Alice', 'Bob']")

    name  age         city
0  Alice   25     New York
1    Bob   32  Los Angeles

Using the loc and iloc indexers: You can use the loc and iloc indexers to filter the DataFrame based on the index and column labels. For example, the following code filters the DataFrame to only include rows where the index is 0 or 1 and the 'name' and 'age' columns:

In [6]:
df.loc[[0,1], ['name','age']]

    name  age
0  Alice   25
1    Bob   32

Using the where() method : You can filter the DataFrame based on a condition and only keep rows where the condition is met, or change the value of the filtered dataframe with different value.

In [7]:
df.where(df['age'] > 30)

      name   age         city
0      NaN   NaN          NaN
1      Bob  32.0  Los Angeles
2  Charlie  45.0      Chicago
3    David  38.0      Houston

In [24]:
df.where((df['age'] > 30) & (df['name'] == 'Bob'))

  name   age         city age_group
0  NaN   NaN          NaN       NaN
1  Bob  32.0  Los Angeles   (25,32]
2  NaN   NaN          NaN       NaN
3  NaN   NaN          NaN       NaN

In [27]:
df.where((df['age'] > 30) | (df['name'] == 'Bob'))

      name   age         city age_group
0      NaN   NaN          NaN       NaN
1      Bob  32.0  Los Angeles   (25,32]
2  Charlie  45.0      Chicago   (32,50]
3    David  38.0      Houston   (32,50]

Using the filter() method: You can filter the DataFrame based on a condition and only keep the columns that meet the condition.

In [8]:
df.filter(like='a', axis=1)

      name  age
0    Alice   25
1      Bob   32
2  Charlie   45
3    David   38

In [10]:
#df_filtered = df.filter(items=lambda x: x['age'] > 30, axis=0) to keep only rows .

# other ways to filter

Using the groupby() method: You can use the groupby() method to group rows of a DataFrame based on the values in one or more columns, and then apply a filter to each group. For example, the following code groups the DataFrame by the 'city' column and filters each group to only include rows where the 'age' column is greater than 30:

In [11]:
df.groupby('city').filter(lambda x: x['age'].mean() > 30)

      name  age         city
1      Bob   32  Los Angeles
2  Charlie   45      Chicago
3    David   38      Houston

Using the nlargest() and nsmallest() methods: You can use the nlargest() and nsmallest() methods to filter a DataFrame to only include the n largest or smallest values in one or more columns. For example, the following code filters the DataFrame to only include the 2 oldest people:

In [12]:
df.nlargest(2, 'age')

      name  age     city
2  Charlie   45  Chicago
3    David   38  Houston

In [13]:
df.nsmallest(2, 'age')

    name  age         city
0  Alice   25     New York
1    Bob   32  Los Angeles

Using the pd.cut() method: You can use the pd.cut() method to filter a DataFrame based on the values of a column and create bins of a specific width. For example, the following code creates a new column 'age_group' and filter the DataFrame to only include rows where the 'age_group' column is (30,40]:

In [14]:
df['age_group'] = pd.cut(df['age'], bins=[25,30,40,50], labels=['(25,30]','(30,40]','(40,50]'])
df.loc[df['age_group'] == '(30,40]']

    name  age         city age_group
1    Bob   32  Los Angeles   (30,40]
3  David   38      Houston   (30,40]

Using the pd.qcut() method: You can use the pd.qcut() method to filter a DataFrame based on the values of a column and create quantile bins. For example, the following code creates a new column 'age_group' and filter the DataFrame to only include rows where the 'age_group' column is (25,32]:

In [15]:
df['age_group'] = pd.qcut(df['age'], q=[0, .5, 1], labels=['(25,32]','(32,50]'])
df.loc[df['age_group'] == '(25,32]']

    name  age         city age_group
0  Alice   25     New York   (25,32]
1    Bob   32  Los Angeles   (25,32]

# more functions to go

Using the apply() method: You can use the apply() method to apply a function to each row or column of a DataFrame and filter the DataFrame based on the function's output. For example, the following code filters the DataFrame to only include the rows where the 'name' column is longer than 5 characters:

In [16]:
df[df.apply(lambda x: len(x['name']) > 5, axis=1)]

      name  age     city age_group
2  Charlie   45  Chicago   (32,50]

In [17]:
df.query("age > 30 & name == 'Bob'")

  name  age         city age_group
1  Bob   32  Los Angeles   (25,32]

In [26]:
df.query("age > 30 | name == 'Bob'")

      name  age         city age_group
1      Bob   32  Los Angeles   (25,32]
2  Charlie   45      Chicago   (32,50]
3    David   38      Houston   (32,50]

In [19]:
#df.query("age > @age & name == @name", engine='python')

In [20]:
df.eval("age > 30 & name == 'Bob'")

0    False
1     True
2    False
3    False
dtype: bool

Using the mask() method: You can use the mask() method to filter a DataFrame based on a condition and only include the rows where the condition is not met. For example, the following code filters the DataFrame to exclude the rows where the 'age' column is less than 30:

In [21]:
df.mask(df['age'] < 30)

      name   age         city age_group
0      NaN   NaN          NaN       NaN
1      Bob  32.0  Los Angeles   (25,32]
2  Charlie  45.0      Chicago   (32,50]
3    David  38.0      Houston   (32,50]

Using the select() method: You can use the select() method to filter the DataFrame based on multiple conditions on one or more columns. For example, the following code filters the DataFrame to only include rows where the 'age' column is greater than 30 and the 'name' column starts with 'B':

In [23]:
#df.select(lambda x: x['age'] > 30 and x['name'].startswith('B'))

Using the at() and iat() methods: You can use the at() and iat() methods to access a scalar value in a DataFrame based on its index and column label. For example, the following code filters the DataFrame to only include the value of the 'age' column for the person with the name 'Bob':

In [25]:
df.at[df[df['name']=='Bob'].index[0], 'age']

32

--------------------------------------------------------------------------------